app/models/user.rb

SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 2]]
---
  def assign_default_role
    if self.email.eql?('admin@mail.com')
      self.add_role(:admin) if self.roles.blank?